Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxRif_regdef.h
/** \brief Module Identification Register */
typedef struct _Ifx_RIF_ID_Bits
{
    Ifx_UReg_32Bit MODREV:8;          /**< \brief [7:0] Module Revision Number - MODREV (r) */
    Ifx_UReg_32Bit MODTYPE:8;         /**< \brief [15:8] Module Type - MODTYPE (r) */
    Ifx_UReg_32Bit MODNUMBER:16;      /**< \brief [31:16] Module Number Value - MODNUMBER (r) */
} Ifx_RIF_ID_Bits;

/** \brief Interrupt Control Register */
typedef struct _Ifx_RIF_INTCON_Bits
{
    Ifx_UReg_32Bit CALE:1;            /**< \brief [0:0] Calibration End Interrupt Enable - CALE (rw) */
    Ifx_UReg_32Bit FWE:1;             /**< \brief [1:1] Frame Watchdog Enable - FWE (rw) */
    Ifx_UReg_32Bit REE:1;             /**< \brief [2:2] Ramp End Enable - REE (rw) */
    Ifx_UReg_32Bit CEE:1;             /**< \brief [3:3] Chirp End Enable - CEE (rw) */
    Ifx_UReg_32Bit CRCE0:1;           /**< \brief [4:4] CRC Error Flag Enable 0 - CRCE0 (rw) */
    Ifx_UReg_32Bit CRCE1:1;           /**< \brief [5:5] CRC Error Flag Enable 1 - CRCE1 (rw) */
    Ifx_UReg_32Bit CRCE2:1;           /**< \brief [6:6] CRC Error Flag Enable 2 - CRCE2 (rw) */
    Ifx_UReg_32Bit CRCE3:1;           /**< \brief [7:7] CRC Error Flag Enable 3 - CRCE3 (rw) */
    Ifx_UReg_32Bit R1EE:1;            /**< \brief [8:8] RAMP1 Error Enable - R1EE (rw) */
    Ifx_UReg_32Bit C1EE:1;            /**< \brief [9:9] CHIRP1 Error Enable - C1EE (rw) */
    Ifx_UReg_32Bit R1SE:1;            /**< \brief [10:10] RAMP1 Start Enable - R1SE (rw) */
    Ifx_UReg_32Bit reserved_11:5;     /**< \brief [15:11] \internal Reserved */
    Ifx_UReg_32Bit CALF:1;            /**< \brief [16:16] Calibration End Interrupt Flag - CALF (r) */
    Ifx_UReg_32Bit FWF:1;             /**< \brief [17:17] Frame Watchdog Interrupt Flag - FWF (r) */
    Ifx_UReg_32Bit REF:1;             /**< \brief [18:18] Ramp End Flag - REF (r) */
    Ifx_UReg_32Bit CEF:1;             /**< \brief [19:19] Chirp End Flag - CEF (r) */
    Ifx_UReg_32Bit CRCF0:1;           /**< \brief [20:20] CRC Error Flag 0 - CRCF0 (r) */
    Ifx_UReg_32Bit CRCF1:1;           /**< \brief [21:21] CRC Error Flag 1 - CRCF1 (r) */
    Ifx_UReg_32Bit CRCF2:1;           /**< \brief [22:22] CRC Error Flag 2 - CRCF2 (r) */
    Ifx_UReg_32Bit CRCF3:1;           /**< \brief [23:23] CRC Error Flag 3 - CRCF3 (r) */
    Ifx_UReg_32Bit R1EF:1;            /**< \brief [24:24] RAMP1 Error Flag - R1EF (r) */
    Ifx_UReg_32Bit C1EF:1;            /**< \brief [25:25] CHIRP1 Error Flag - C1EF (r) */
    Ifx_UReg_32Bit R1SF:1;            /**< \brief [26:26] RAMP1 Start Flag - R1SF (r) */
    Ifx_UReg_32Bit reserved_27:5;     /**< \brief [31:27] \internal Reserved */
} Ifx_RIF_INTCON_Bits;

/** \brief Internal Parallel Interface Register */
typedef struct _Ifx_RIF_IPI_Bits
{
    Ifx_UReg_32Bit DL:2;              /**< \brief [1:0] Data Length - DL (rw) */
    Ifx_UReg_32Bit reserved_2:1;      /**< \brief [2:2] \internal Reserved */
    Ifx_UReg_32Bit PFP:1;             /**< \brief [3:3] Parallel Frame Polarity - PFP (rw) */
    Ifx_UReg_32Bit reserved_4:12;     /**< \brief [15:4] \internal Reserved */
    Ifx_UReg_32Bit EN0:1;             /**< \brief [16:16] Enable Deserializer 0 - EN0 (rw) */
    Ifx_UReg_32Bit EN1:1;             /**< \brief [17:17] Enable Deserializer 1 - EN1 (rw) */
    Ifx_UReg_32Bit EN2:1;             /**< \brief [18:18] Enable Deserializer 2 - EN2 (rw) */
    Ifx_UReg_32Bit EN3:1;             /**< \brief [19:19] Enable Deserializer 3 - EN3 (rw) */
    Ifx_UReg_32Bit reserved_20:11;    /**< \brief [30:20] \internal Reserved */
    Ifx_UReg_32Bit SDDV:1;            /**< \brief [31:31] SRIF Debug Data Valid - SDDV (rh) */
} Ifx_RIF_IPI_Bits;

/** \brief Kernel Reset Register 0 */
typedef struct _Ifx_RIF_KRST0_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit RSTSTAT:1;         /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_RIF_KRST0_Bits;

/** \brief Kernel Reset Register 1 */
typedef struct _Ifx_RIF_KRST1_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_RIF_KRST1_Bits;

/** \brief Kernel Reset Status Clear Register */
typedef struct _Ifx_RIF_KRSTCLR_Bits
{
    Ifx_UReg_32Bit CLR:1;             /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_RIF_KRSTCLR_Bits;

/** \brief LVDS Control Register 0 */
typedef struct _Ifx_RIF_LVDSCON0_Bits
{
    Ifx_UReg_32Bit FRAME:8;           /**< \brief [7:0] Frame LVDS Pad Control - FRAME (rw) */
    Ifx_UReg_32Bit CLK:8;             /**< \brief [15:8] CLOCK LVDS Pad Control - CLK (rw) */
    Ifx_UReg_32Bit DATA0:8;           /**< \brief [23:16] DATA0 LVDS Pad Control - DATA0 (rw) */
    Ifx_UReg_32Bit DATA1:8;           /**< \brief [31:24] DATA1 LVDS Pad Control - DATA1 (rw) */
} Ifx_RIF_LVDSCON0_Bits;

/** \brief LVDS Control Register 1 */
typedef struct _Ifx_RIF_LVDSCON1_Bits
{
    Ifx_UReg_32Bit DATA2:8;           /**< \brief [7:0] DATA2 LVDS Pad Control - DATA2 (rw) */
    Ifx_UReg_32Bit DATA3:8;           /**< \brief [15:8] DATA3 LVDS Pad Control - DATA3 (rw) */
    Ifx_UReg_32Bit MISC:3;            /**< \brief [18:16] Miscellaneous Common LVDS Pad Control - MISC (rw) */
    Ifx_UReg_32Bit RTERM:3;           /**< \brief [21:19] Termination Resistor Trimming - RTERM (rw) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit PWRDN:1;           /**< \brief [24:24] LVDS Bias Distributor Power Down - PWRDN (rw) */
    Ifx_UReg_32Bit LVDS5VEN:1;        /**< \brief [25:25] Enable 5V Mode for LVDS Bias Distributor - LVDS5VEN (rw) */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_RIF_LVDSCON1_Bits;

/** \brief OCDS Control and Status */
typedef struct _Ifx_RIF_OCS_Bits
{
    Ifx_UReg_32Bit TGS:2;             /**< \brief [1:0] Trigger Set for OTGB0/1 - TGS (rw) */
    Ifx_UReg_32Bit TGB:1;             /**< \brief [2:2] OTGB0/1 Bus Select - TGB (rw) */
    Ifx_UReg_32Bit TG_P:1;            /**< \brief [3:3] TGS, TGB Write Protection - TG_P (w) */
    Ifx_UReg_32Bit reserved_4:20;     /**< \brief [23:4] \internal Reserved */
    Ifx_UReg_32Bit SUS:4;             /**< \brief [27:24] OCDS Suspend Control - SUS (rw) */
    Ifx_UReg_32Bit SUS_P:1;           /**< \brief [28:28] SUS Write Protection - SUS_P (w) */
    Ifx_UReg_32Bit SUSSTA:1;          /**< \brief [29:29] Suspend State - SUSSTA (rh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_RIF_OCS_Bits;

/** \brief Radar State Machine Register 0 */
typedef struct _Ifx_RIF_RSM0_Bits
{
    Ifx_UReg_32Bit R1:4;              /**< \brief [3:0] Ramp 1 Phase in Number of Samples - R1 (rw) */
    Ifx_UReg_32Bit reserved_4:4;      /**< \brief [7:4] \internal Reserved */
    Ifx_UReg_32Bit R3:4;              /**< \brief [11:8] Ramp 3 Phase in Number of Samples - R3 (rw) */
    Ifx_UReg_32Bit WAIT:4;            /**< \brief [15:12] Wait Phase in Number of Samples - WAIT (rw) */
    Ifx_UReg_32Bit PAUSE:4;           /**< \brief [19:16] Pause Phase infPREperiods - PAUSE (rw) */
    Ifx_UReg_32Bit reserved_20:4;     /**< \brief [23:20] \internal Reserved */
    Ifx_UReg_32Bit PRE:6;             /**< \brief [29:24] Prescaler - PRE (rw) */
    Ifx_UReg_32Bit LCKSTP:1;          /**< \brief [30:30] Lockstep Enable Bit - LCKSTP (rw) */
    Ifx_UReg_32Bit INTADC:1;          /**< \brief [31:31] Internal ADC Enable Bit - INTADC (rw) */
} Ifx_RIF_RSM0_Bits;

/** \brief Radar State Machine Register 1 */
typedef struct _Ifx_RIF_RSM1_Bits
{
    Ifx_UReg_32Bit RAMPS:11;          /**< \brief [10:0] Number of Ramps per Chirp - RAMPS (rw) */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit C1SEL:2;           /**< \brief [13:12] Select Bit for CHIRP1 Signal - C1SEL (rw) */
    Ifx_UReg_32Bit R1SEL:2;           /**< \brief [15:14] Select Bit for RAMP1 Signal - R1SEL (rw) */
    Ifx_UReg_32Bit CURRAMP:12;        /**< \brief [27:16] Number of Current Ramp - CURRAMP (r) */
    Ifx_UReg_32Bit C1POL:1;           /**< \brief [28:28] Polarity of CHIRP1 Signal - C1POL (rw) */
    Ifx_UReg_32Bit R1POL:1;           /**< \brief [29:29] Polarity of RAMP1 Signal - R1POL (rw) */
    Ifx_UReg_32Bit C1EN:1;            /**< \brief [30:30] Enable for CHIRP1 Signal - C1EN (rw) */
    Ifx_UReg_32Bit R1EN:1;            /**< \brief [31:31] Enable for RAMP1 Signal - R1EN (rw) */
} Ifx_RIF_RSM1_Bits;

