Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxRif_regdef.h
/** \brief Radar State Machine Register 2 */
typedef struct _Ifx_RIF_RSM2_Bits
{
    Ifx_UReg_32Bit SAMPLES:11;        /**< \brief [10:0] Number of Valid Data Samples - SAMPLES (rw) */
    Ifx_UReg_32Bit reserved_11:5;     /**< \brief [15:11] \internal Reserved */
    Ifx_UReg_32Bit CURSAMPLE:12;      /**< \brief [27:16] Number of the Current Valid Data Sample - CURSAMPLE (r) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_RIF_RSM2_Bits;

/** \brief Radar State Machine 2 Capture Register */
typedef struct _Ifx_RIF_RSM2CAP_Bits
{
    Ifx_UReg_32Bit reserved_0:16;     /**< \brief [15:0] \internal Reserved */
    Ifx_UReg_32Bit ENDSAMPLE:12;      /**< \brief [27:16] Value of the Current Sample at the End of the Ramp - ENDSAMPLE (r) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_RIF_RSM2CAP_Bits;

/** \brief SRIF Override Configuration Register */
typedef struct _Ifx_RIF_SRIFOVRCFG_Bits
{
    Ifx_UReg_32Bit SKMR:2;            /**< \brief [1:0] Skew Management Ratio - SKMR (rw) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_RIF_SRIFOVRCFG_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_rif_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_ACCEN0_Bits B;            /**< \brief Bitfield access */
} Ifx_RIF_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_ACCEN1_Bits B;            /**< \brief Bitfield access */
} Ifx_RIF_ACCEN1;

/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_CLC_Bits B;               /**< \brief Bitfield access */
} Ifx_RIF_CLC;

/** \brief Debug Data Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_DBG0_Bits B;              /**< \brief Bitfield access */
} Ifx_RIF_DBG0;

/** \brief Debug Data Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_DBG1_Bits B;              /**< \brief Bitfield access */
} Ifx_RIF_DBG1;

/** \brief Debug Delay Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_DBGDLY0_Bits B;           /**< \brief Bitfield access */
} Ifx_RIF_DBGDLY0;

/** \brief Debug Delay Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_DBGDLY1_Bits B;           /**< \brief Bitfield access */
} Ifx_RIF_DBGDLY1;

/** \brief Data Formatting Unit Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_DFU_Bits B;               /**< \brief Bitfield access */
} Ifx_RIF_DFU;

/** \brief Data Memory Interface Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_DMI_Bits B;               /**< \brief Bitfield access */
} Ifx_RIF_DMI;

/** \brief External Serial Interface Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_ESI_Bits B;               /**< \brief Bitfield access */
} Ifx_RIF_ESI;

/** \brief Flags Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_FLAGSCL_Bits B;           /**< \brief Bitfield access */
} Ifx_RIF_FLAGSCL;

/** \brief Flags Set Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_FLAGSSET_Bits B;          /**< \brief Bitfield access */
} Ifx_RIF_FLAGSSET;

/** \brief FIFO and Lane Management Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_FLM_Bits B;               /**< \brief Bitfield access */
} Ifx_RIF_FLM;

/** \brief Frame Watchdog Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_FWDG_Bits B;              /**< \brief Bitfield access */
} Ifx_RIF_FWDG;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_ID_Bits B;                /**< \brief Bitfield access */
} Ifx_RIF_ID;

/** \brief Interrupt Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_INTCON_Bits B;            /**< \brief Bitfield access */
} Ifx_RIF_INTCON;

/** \brief Internal Parallel Interface Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_IPI_Bits B;               /**< \brief Bitfield access */
} Ifx_RIF_IPI;

