Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxRif_regdef.h
/** \brief Kernel Reset Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_KRST0_Bits B;             /**< \brief Bitfield access */
} Ifx_RIF_KRST0;

/** \brief Kernel Reset Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_KRST1_Bits B;             /**< \brief Bitfield access */
} Ifx_RIF_KRST1;

/** \brief Kernel Reset Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_KRSTCLR_Bits B;           /**< \brief Bitfield access */
} Ifx_RIF_KRSTCLR;

/** \brief LVDS Control Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_LVDSCON0_Bits B;          /**< \brief Bitfield access */
} Ifx_RIF_LVDSCON0;

/** \brief LVDS Control Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_LVDSCON1_Bits B;          /**< \brief Bitfield access */
} Ifx_RIF_LVDSCON1;

/** \brief OCDS Control and Status   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_OCS_Bits B;               /**< \brief Bitfield access */
} Ifx_RIF_OCS;

/** \brief Radar State Machine Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_RSM0_Bits B;              /**< \brief Bitfield access */
} Ifx_RIF_RSM0;

/** \brief Radar State Machine Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_RSM1_Bits B;              /**< \brief Bitfield access */
} Ifx_RIF_RSM1;

/** \brief Radar State Machine Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_RSM2_Bits B;              /**< \brief Bitfield access */
} Ifx_RIF_RSM2;

/** \brief Radar State Machine 2 Capture Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_RSM2CAP_Bits B;           /**< \brief Bitfield access */
} Ifx_RIF_RSM2CAP;

/** \brief SRIF Override Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_RIF_SRIFOVRCFG_Bits B;        /**< \brief Bitfield access */
} Ifx_RIF_SRIFOVRCFG;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxLld_Rif_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief RIF object */
typedef volatile struct _Ifx_RIF
{
       Ifx_RIF_CLC                         CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_RIF_ID                          ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_RIF_ESI                         ESI;                    /**< \brief 10, External Serial Interface Register*/
       Ifx_RIF_IPI                         IPI;                    /**< \brief 14, Internal Parallel Interface Register*/
       Ifx_RIF_FLM                         FLM;                    /**< \brief 18, FIFO and Lane Management Register*/
       Ifx_RIF_DMI                         DMI;                    /**< \brief 1C, Data Memory Interface Register*/
       Ifx_RIF_RSM0                        RSM0;                   /**< \brief 20, Radar State Machine Register 0*/
       Ifx_RIF_RSM1                        RSM1;                   /**< \brief 24, Radar State Machine Register 1*/
       Ifx_RIF_RSM2                        RSM2;                   /**< \brief 28, Radar State Machine Register 2*/
       Ifx_RIF_INTCON                      INTCON;                 /**< \brief 2C, Interrupt Control Register*/
       Ifx_RIF_FLAGSSET                    FLAGSSET;               /**< \brief 30, Flags Set Register*/
       Ifx_RIF_FLAGSCL                     FLAGSCL;                /**< \brief 34, Flags Clear Register*/
       Ifx_RIF_FWDG                        FWDG;                   /**< \brief 38, Frame Watchdog Register*/
       Ifx_RIF_DFU                         DFU;                    /**< \brief 3C, Data Formatting Unit Register*/
       Ifx_RIF_SRIFOVRCFG                  SRIFOVRCFG;             /**< \brief 40, SRIF Override Configuration Register*/
       Ifx_RIF_RSM2CAP                     RSM2CAP;                /**< \brief 44, Radar State Machine 2 Capture Register*/
       Ifx_UReg_8Bit                       reserved_48[4];         /**< \brief 48, \internal Reserved  */
       Ifx_RIF_LVDSCON0                    LVDSCON0;               /**< \brief 4C, LVDS Control Register 0*/
       Ifx_RIF_LVDSCON1                    LVDSCON1;               /**< \brief 50, LVDS Control Register 1*/
       Ifx_RIF_DBGDLY0                     DBGDLY0;                /**< \brief 54, Debug Delay Register 0*/
       Ifx_RIF_DBGDLY1                     DBGDLY1;                /**< \brief 58, Debug Delay Register 1*/
       Ifx_UReg_8Bit                       reserved_5C[36];        /**< \brief 5C, \internal Reserved */
       Ifx_RIF_DBG0                        DBG0;                   /**< \brief 80, Debug Data Register 0*/
       Ifx_RIF_DBG1                        DBG1;                   /**< \brief 84, Debug Data Register 1*/
       Ifx_UReg_8Bit                       reserved_88[96];        /**< \brief 88, \internal Reserved */
       Ifx_RIF_OCS                         OCS;                    /**< \brief E8, OCDS Control and Status*/
       Ifx_RIF_KRSTCLR                     KRSTCLR;                /**< \brief EC, Kernel Reset Status Clear Register*/
       Ifx_RIF_KRST1                       KRST1;                  /**< \brief F0, Kernel Reset Register 1*/
       Ifx_RIF_KRST0                       KRST0;                  /**< \brief F4, Kernel Reset Register 0*/
       Ifx_RIF_ACCEN1                      ACCEN1;                 /**< \brief F8, Access Enable Register 1*/
       Ifx_RIF_ACCEN0                      ACCEN0;                 /**< \brief FC, Access Enable Register 0*/
       Ifx_UReg_8Bit                       reserved_100[256];      /**< \brief 100, \internal Reserved */
} Ifx_RIF;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXRIF_REGDEF_H */
